package com.kbfg.framework.config;

import org.springframework.context.annotation.ComponentScan;
import org.springframework.context.annotation.Configuration;
import org.springframework.web.servlet.config.annotation.EnableWebMvc;
import org.springframework.web.servlet.config.annotation.WebMvcConfigurerAdapter;

/**
 * <pre>
 *
 * 파일명     : WebMvcConfigurer.ja----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------va
 * 프로젝트  : ContentApi
 * 날짜        : 2020. 9. 16.
 * ===============================================================================
 * 			날짜	      		|    	작성자		 	|			내	용		      |	  
 * ===============================================================================
 * 	     2020. 9. 16.     	|	   kbfg196       	|                             |
 * ===============================================================================
 * </pre>
 */
@SuppressWarnings("deprecation")
@Configuration
@EnableWebMvc
@ComponentScan("com.kbfg.account")
public class WebMvcConfigurer extends WebMvcConfigurerAdapter {
  
}
